In [2]:
import numpy as np
import pandas as pd

In [53]:
d = {'A':[1,2,np.nan], 
     'B':[2, np.nan, np.nan], 
     'C':[1, 2, 3]}

In [54]:
df = pd.DataFrame(d, index =  ['X', 'Y', 'Z'])
df

     A    B  C
X  1.0  2.0  1
Y  2.0  NaN  2
Z  NaN  NaN  3

In [55]:
df.dropna(axis = 0)

     A    B  C
X  1.0  2.0  1

In [56]:
df.dropna(axis = 0, thresh  = 2)

     A    B  C
X  1.0  2.0  1
Y  2.0  NaN  2

In [57]:
df

     A    B  C
X  1.0  2.0  1
Y  2.0  NaN  2
Z  NaN  NaN  3

In [60]:
df['A'].fillna(value = df['A'].mean())

X    1.0
Y    2.0
Z    1.5
Name: A, dtype: float64